// Какие бывают алгоритмы сортировок?

// Алгоритмов сортировки достаточно много. Перечислю несколько самых популярных. И без кода, при необходимости можно найти в интернетике

// - пузырьковая

// сложность - квадратичная (цикл вложен в цикл, при этом количество итераций в циклах одинаково и равно длине массива)

// - сортировка выбором

// сложность - квадратичная (цикл вложен в цикл, при этом количество итераций в циклах одинаково и равно длине массива)

// - быстрая сортировка

// сложность - O(n * log n), в худшем - O(n2).

// - сортировка слиянием

// сложность - O(n * log n)

// сортировка вставками - O(N), в худшем - O(N^2)